document.addEventListener('DOMContentLoaded', function() {
    // 获取所有切换按钮
    const styleButtons = document.querySelectorAll('.style-btn');
    const styleTheme = document.getElementById('style-theme');
	const toggleButton = document.querySelector('.toggle-switcher');
	const styleSwitcher = document.querySelector('.style-switcher');
	const styleIcon01 = document.getElementById('style-icon-01');
	const styleIcon02 = document.getElementById('style-icon-02');
	const styleIcon03 = document.getElementById('style-icon-03');
	const toggleIcon01 = document.getElementById('toggle-icon-01');
	
	toggleButton.addEventListener('click', function(e) {
        e.stopPropagation();
        styleSwitcher.classList.toggle('collapsed');
    });
    
    // 从本地存储获取保存的风格偏好
    const savedStyle = localStorage.getItem('preferredStyle');
    if (savedStyle) {
        switchStyle(savedStyle);
    }else{
		switchStyle('exhibition_style');
	}
    
    // 为每个按钮添加点击事件
    styleButtons.forEach(button => {
        button.addEventListener('click', function() {
            const style = this.dataset.style;
            switchStyle(style);
            
            // 保存偏好到本地存储
            localStorage.setItem('preferredStyle', style);
        });
    });
    
	styleIcon01.innerHTML = '<path d="M512 53.312a458.688 458.688 0 0 0 0 917.376h7.488c15.36 0.256 38.336 0.64 57.28-4.672 12.288-3.456 26.176-9.92 36.864-22.784 11.008-13.184 15.68-29.568 15.68-47.232 0-35.84-18.368-63.104-30.976-81.792l-1.408-2.048c-10.432-15.424-16.832-25.472-19.584-36.032-2.24-8.512-2.56-19.456 5.952-36.48 10.24-20.48 22.08-28.8 37.952-33.344 19.2-5.568 44.032-5.888 81.92-5.888h0.512c36.288 0 80.832 0 132.864-7.424 51.392-7.296 88-28.032 109.76-64 20.352-33.6 24.32-75.392 24.32-116.992A458.688 458.688 0 0 0 512 53.312zM287.488 598.912l0.384-0.128a42.688 42.688 0 0 1 22.016 82.432l-0.384 0.128a42.688 42.688 0 0 1-22.016-82.432z m21.824-236.224a96 96 0 1 1 192 0 96 96 0 0 1-192 0zM704 309.312a96 96 0 1 1 0 192 96 96 0 0 1 0-192z" p-id="24989"></path>';
	styleIcon02.innerHTML = '<path d="M409.6 460.8H51.2a51.2 51.2 0 0 1-51.2-51.2V51.2A51.2 51.2 0 0 1 51.2 0h358.4a51.2 51.2 0 0 1 51.2 51.2v358.4a51.2 51.2 0 0 1-51.2 51.2zM102.4 358.4h256V102.4H102.4zM972.8 0H614.4a51.2 51.2 0 0 0-51.2 51.2v358.4a51.2 51.2 0 0 0 51.2 51.2h358.4a51.2 51.2 0 0 0 51.2-51.2V51.2a51.2 51.2 0 0 0-51.2-51.2zM409.6 563.2H51.2a51.2 51.2 0 0 0-51.2 51.2v358.4a51.2 51.2 0 0 0 51.2 51.2h358.4a51.2 51.2 0 0 0 51.2-51.2V614.4a51.2 51.2 0 0 0-51.2-51.2zM972.8 1024H614.4a51.2 51.2 0 0 1-51.2-51.2V614.4a51.2 51.2 0 0 1 51.2-51.2h358.4a51.2 51.2 0 0 1 51.2 51.2v358.4a51.2 51.2 0 0 1-51.2 51.2z m-307.2-102.4h256V665.6H665.6z" p-id="21850"></path>';
    styleIcon03.innerHTML = '<path d="M54.908519 968.896424A106.793657 106.793657 0 0 1 24.382113 893.994571V130.688128a106.696128 106.696128 0 0 1 30.33135-75.340731A102.697462 102.697462 0 0 1 128.64003 24.382113h681.577599a103.916567 103.916567 0 0 1 96.260584 76.267251L557.716463 604.676413l7.948569 192.521168 187.644745-53.64065 159.946664-231.532549v381.970189a104.648031 104.648031 0 0 1-103.038812 105.67208H127.957331a102.404876 102.404876 0 0 1-73.048812-30.770227z m92.652032-252.159817a50.080861 50.080861 0 0 0-13.995334 35.3053 48.764227 48.764227 0 0 0 48.471642 49.398162h217.488452a47.740178 47.740178 0 0 0 34.622601-14.239155 50.275918 50.275918 0 0 0 0-70.464307 48.422877 48.422877 0 0 0-34.671365-14.629269H181.93933a47.935235 47.935235 0 0 0-34.427544 14.726797zM131.663413 505.148626a49.934568 49.934568 0 0 0 13.995333 35.3053 47.983999 47.983999 0 0 0 34.476308 14.629268h306.483166a48.032763 48.032763 0 0 0 34.476308-14.629268 49.885804 49.885804 0 0 0 13.946569-35.3053 48.764227 48.764227 0 0 0-48.422877-49.398162H180.08629a48.764227 48.764227 0 0 0-48.422877 49.398162zM138.344112 258.450402a49.641983 49.641983 0 0 0 43.595218 49.739512h414.495929a50.129625 50.129625 0 0 0 0-99.430259h-414.495929A49.690747 49.690747 0 0 0 138.344112 258.450402z m460.43183 366.658222l291.805133-426.345635L1009.419496 290.098386l-291.756369 426.345635-118.93595 33.793609z m326.72032-476.962903l49.008048-71.342064L1097.195105 168.772989l-49.105577 71.2933z" p-id="17755"></path>';
	toggleIcon01.innerHTML = '<path d="M384 256l256 256-256 256z" p-id="26054"></path>';
	
	// 切换风格函数
    function switchStyle(style) {
        // 更新CSS文件链接
        styleTheme.href = `/articles/styles/${style}.css`;
        
        // 更新按钮激活状态
        styleButtons.forEach(btn => {
            btn.classList.toggle('active', btn.dataset.style === style);
        });
        
        // 更新body的类名（可选，用于某些特定样式）
        document.body.className = style;
    }
});
